app/views/skills/new.html.erb

    <% if @skill.project.nil? %>
      <%= s.select :project_id, options_from_collection_for_select(Project.all, :id, :title) %><br>
---
SELECT "projects".* FROM "projects"