app/views/skills/show.html.erb

<h1><%= @skill.name %></h1>
<h3><%= pluralize(@skill.projects.count, 'Project') %></h3>
<ul>
  <% @skill.projects.each do |p| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."skill_id" = ?  [["skill_id", 1]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."skill_id" = ?  [["skill_id", 1]]