app/views/sections/_project.html.erb

SELECT "projects".* FROM "projects" INNER JOIN "skills" ON "projects"."id" = "skills"."project_id" WHERE "skills"."section_id" = ?  [["section_id", 1]]
---
<% if defined?(@section.projects) %>
<% @section.projects.each do |project| %>