app/views/sections/show.html.erb

<% if defined?(@section.projects) %>
  <% @section.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" INNER JOIN "skills" ON "projects"."id" = "skills"."project_id" WHERE "skills"."section_id" = ?  [["section_id", 1]]