app/views/projects/show.html.erb

<% if defined?(@project.skills) %>
  <% @project.skills.each do |t| %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."project_id" = ?  [["project_id", 1]]