app/controllers/projects_controller.rb

	def index
		if session[:user_id]
			@user = User.find(session[:user_id])
		end
		@projects = Project.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects"

	def new
		@project = Project.new
		@skills = Skill.all
---
SELECT "skills".* FROM "skills"

	def create
		project = Project.create(project_params)
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Mini coin another project"], ["description", "this is mini coin description"], ["created_at", "2022-09-22 07:09:05.121970"], ["updated_at", "2022-09-22 07:09:05.121970"]]

	def edit
		@project = Project.find(params[:id])
		@skills = Skill.all
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "skills".id FROM "skills" WHERE "skills"."project_id" = ?  [["project_id", 2]]

	def update
	  project = Project.find(params[:id])
	  project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Mini Trackersss"], ["description", ""], ["updated_at", "2022-09-22 05:23:26.707764"], ["id", 2]]

	def destroy
		Project.find(params[:id]).destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 5]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]