app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
	def index
		@sections = Section.all

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def show
		@section = Section.find(params[:id])

SELECT "skills".* FROM "skills"
---
	def new
		@section = Section.new
		@skills = Skill.all

INSERT INTO "sections" ("title") VALUES (?)  [["title", "A random section"]]
---
	def create
		section = Section.create(section_params)

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "skills".id FROM "skills" WHERE "skills"."section_id" = ?  [["section_id", 1]]
---
	def edit
		@section = Section.find(params[:id])
		@skills = Skill.all

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "sections" SET "title" = ? WHERE "sections"."id" = ?  [["title", "Software33"], ["id", 1]]
---
	def update
      section = Section.find(params[:id])
	  section.update(section_params)

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def destroy
		Section.find(params[:id]).destroy