app/controllers/sessions_controller.rb

INSERT INTO "users" ("uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uid", "26340792"], ["name", "Claudia Ruiz"], ["created_at", "2022-10-08 01:57:44.503862"], ["updated_at", "2022-10-08 01:57:44.503862"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "26340792"], ["LIMIT", 1]]
---
    def create
      @user =
        User.find_or_create_by(uid: auth['uid']) do |u|