app/controllers/skills_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "skills".* FROM "skills" WHERE "skills"."project_id" = ?  [["project_id", 2]]
SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
      if params[:project_id]
        @skills = Project.find(params[:project_id]).skills
      else
        @skills = Skill.all

SELECT "projects".* FROM "projects" WHERE "projects"."skill_id" = ?  [["skill_id", 1]]
SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:project_id]
          project = Project.find_by(id: params[:project_id])
          if project.nil?
            redirect_to projects_path, alert: "Project not found."
          else
            @skill = project.skills.find_by(id: params[:id])

SELECT "projects".* FROM "projects"
---
    def new
      if params[:project_id] && !Project.exists?(params[:project_id])

INSERT INTO "skills" ("name") VALUES (?)  [["name", "HTML"]]
---
    def create
      skill = Skill.create(skill_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      if params[:project_id]
        project = Project.find_by(id: params[:project_id])
        if project.nil?
          redirect_to projects_path, alert: "Project not found."
          else
            @skill = project.skills.find_by(id: params[:id])

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "skills" SET "name" = ?, "updated_at" = ? WHERE "skills"."id" = ?  [["name", "JavaScripts"], ["updated_at", "2022-09-21 09:21:28.001488"], ["id", 1]]
---
    def update
      skill = Skill.find(params[:id])
      skill.update(skill_params)

DELETE FROM "skills" WHERE "skills"."id" = ?  [["id", 1]]
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
      Skill.find(params[:id]).destroy